[
  {    
      "id": 1,
      "title": "Star Wars: Episode I - The Phantom Menace",
      "logo": "../../src/assets/films/logo_episode01.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/EP1-IA-99993-RESIZED_f9ae99b6.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1i03i1w_d8ae20f0.jpeg",
          "description": "The Trade Federation boldly blockades Naboo with a ring of battleships. In response, the Republic sends Jedi ambassadors to negotiate a peaceful settlement."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-19ctjn_d21c11e0.jpeg",
          "description": "The Trade Federation has no interest in negotiation. They instead attack Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi with battle droids."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-hhlyow_2ee9e9c2.jpeg",
          "description": "Escaping to Naboo's surface, Qui-Gon Jinn saves Gungan outcast Jar Jar Binks from being trampled by the invading Trade Federation army."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1h6r5fb_fadec3fe.jpeg",
          "description": "Obi-Wan, Qui-Gon and Jar Jar warn the ruler of Otoh Gunga, Boss Nass, that the droid army will attack the Naboo surface-dwellers, and that the Gungans are not safe in their underwater city. Nass, however, wants nothing to do with the Naboo."
        }
      ]
    },
    {
      "id": 2,
      "title": "Star Wars: Episode II - Attack of the Clones",
      "logo": "../../src/assets/films/logo_episode02.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/EP2-IA-69221-RESIZED_1e8e0971.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/df98223378923c2cda44680a41b13f7530c0f527.jpeg",
          "description": "Senator Amidala returns to Coruscant for a most important vote that will determine if the Republic will create an army to oppose the rise of the Separatists. Amidala wants a peaceful resolution to the crisis, and fears an army will only provoke a full galactic war. "
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-ewpaxp_234154a2.jpeg",
          "description": "Handmaiden Corde, posing as Senator Padmé Amidala, is killed when the Naboo cruiser is blown apart by an explosion. A mysterious assassin is targeting Padmé. She believes it to be Count Dooku."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1io2lr0_369885be.jpeg",
          "description": "The Jedi Council warns Chancellor Palpatine that one wrong move could start a war between the Republic and the Separatists. Mace Windu reminds the Chancellor that the Jedi are not soldiers, but peacekeepers. "
        }
      ]
    },
    {
      "id": 3,
      "title": "Star Wars: Episode III - Revenge of the Sith",
      "logo": "../../src/assets/films/logo_episode03.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/image_ff356cdb.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/image_f5166680.jpeg",
          "description": "The explosive Clone Wars conflicts arrives on Coruscant. The wicked General Grievous has kidnapped Chancellor Palpatine, and escapes the capital with his prize hostage. Anakin Skywalker and Obi-Wan Kenobi, heroes of the Clone Wars, race in pursuit aboard their tiny Jedi starfighters."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/ep3-q4_ee692b80.jpeg",
          "description": "Anakin and Obi-Wan fly their fighters directly into Grievous' flagship, and make their way through the ship's massive interior. They find the Chancellor, bound in a chair within the general's quarters. Awaiting their arrival is the Sith Lord, Count Dooku, who engages them in a lightsaber duel."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-5ek0sk_36e06a2b.jpeg",
          "description": "Anakin and Obi-Wan face Dooku in tandem. He is a skilled duelist. Dooku uses the Force to batter Obi-Wan unconscious, leaving Anakin alone to face his enemy. Anakin's abilities have grown since last they fought. Anakin disarms Dooku, and at Palpatine's goading, he kills the Count, despite such a cold act being against the Jedi way."
        }
      ]
    },
    {
      "id": 4,
      "title": "Star Wars: Episode IV - A New Hope",
      "logo": "../../src/assets/films/logo_episode04.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/EP4_POS_2_D-RESIZED_f977074a.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-13oku6w_bb2a0468.jpeg",
          "description": "An Imperial Star Destroyer pursues Princess Leia's diplomatic consular ship."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1bjzle8_34ee4684.jpeg",
          "description": "The Alderaan cruiser is drawn into the underside of an Imperial Star Destroyer."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1uodr2j_18346e60.jpeg",
          "description": "C-3PO and R2-D2 scramble for cover from the impending Imperial boarding party. "
        }
      ]
    },
    {
      "id": 5,
      "title": "Star Wars: Episode V - The Empire Strikes Back",
      "logo": "../../src/assets/films/logo_episode05.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/image_ca7910bd.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1urgahh_eb98a547.jpeg",
          "description": "On the ice planet of Hoth, Luke Skywalker patrols the landscape on his tauntaun searching for any signs of life on the barren planet."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-shafhi_a8516c41.jpeg",
          "description": "While on patrol, Luke is attacked by a wampa -- a large fur-covered beast -- which knocks Luke unconscious and kills his tauntaun. The wampa drags Luke back to its cave."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-cznvy8_2f9d5b92.jpeg",
          "description": "At the Rebels' secret Echo Base, Princess Leia is informed that Luke has not reported in from his patrol. Han Solo decides to risk the elements outside and look for Luke."
        }
      ]
    },
    {
      "id": 6,
      "title": "Star Wars: Episode VI - Return of the Jedi",
      "logo": "../../src/assets/films/logo_episode06.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/EP6_POS_21_R-RESIZED_2873dc04.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1hu1or_f6dc211f.jpeg",
          "description": "Darth Vader's shuttle disembarks from a Star Destroyer and heads toward the second Death Star, which is under construction high over the moon of Endor."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1sl6tgp_42df3f4c.jpeg",
          "description": "Commander Jerjerrod greets Darth Vader on the second Death Star. Vader announces that he is there to oversee the superweapon's construction, which has fallen behind schedule. He adds that the Emperor himself will soon be arriving, someone certain to be less forgiving of excuses for delays."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/open-uri20150608-27674-1hjub6m_2c133217.jpeg",
          "description": "On Tatooine, C-3PO and R2-D2 approach Jabba's Palace where the Hutt gangster holds the frozen Han Solo captive. "
        }
      ]
    },
    {
      "id": 7,
      "title": "Star Wars: Episode VII - The Force Awakens",
      "logo": "../../src/assets/films/logo_episode07.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/avco_payoff_1-sht_v7_lg_32e68793.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/01_305e65e1.jpeg",
          "description": "A squad of First Order stormtroopers, en route to the desert world Jakku, prepare for their mission."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/02_2de80267.jpeg",
          "description": "Meanwhile, Resistance pilot Poe Dameron meets with an old ally of General Leia Organa’s named Lor San Tekka. Tekka is in possession of a clue to Luke Skywalker’s whereabouts, and passes it on to Poe. But the First Order is fast approaching, and the ball-droid BB-8 bursts in to tell Dameron."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/03_f60c0992.jpeg",
          "description": "Upon landing, the First Order immediately open fire on the villagers. Stormtroopers mercilessly pull them from their homes and round up all in sight, hoping to find the clue now in Poe’s hands."
        }
      ]
    },
    {
      "id": 8,
      "title": "Star Wars: Episode VIII - The Last Jedi",
      "logo": "../../src/assets/films/logo_episode08.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/sb_teaser2_1-sht_v3a_online_lg_86f89198.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-1_0cea6ce7.jpeg",
          "description": "Following the destruction of the Republic capital, Supreme Leader Snoke aims to cement his grip on the galaxy and sends his forces to the Resistance base."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-2_402ef60e.jpeg",
          "description": "In his X-wing, Poe Dameron heads for the First Order fleet. After some creative stalling, he speeds toward the Dreadnought, eliminating its surface cannons so Resistance bombers can mount an attack."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-3_fb71cea3.jpeg",
          "description": "With the bombers suffering heavy losses, General Leia Organa orders a retreat; Poe ignores the command, however, encouraging the pilots onward. One bomber makes it through, and Paige Tico delivers the payload with her final act, destroying the Dreadnought."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-4_28ea0ec3.jpeg",
          "description": "Aboard the Resistance command ship, Finn wakes from his coma, a result of his injuries suffered at the hands of Kylo Ren. He instantly calls out for Rey."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-5_c2ae2a5a.jpeg",
          "description": "Now on Ahch-To, Rey has finally found Luke Skywalker, the legendary Jedi who vanished following a student's fall to the dark side and subsequent decimation of a nacent Jedi Order. She hands Luke his old lightsaber, which he quickly tosses over his shoulder. He will not help her."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/tlj-story-gallery-6_d867f97f.jpeg",
          "description": "Snoke meets with his top commanders. While initially angered with Hux, he is pleased that the general has the Resistance fleet on a string. The Supreme Leader saves his true wrath for his dark apprentice, however, berating Kylo Ren for his failure to defeat Rey. Afterward, an enraged Ren destroys his helmet and readies his TIE fighter."
        }
      ]
    },
    {
      "id": 9,
      "title": "Star Wars: Episode IX - The Rise of Skywalker",
      "logo": "../../src/assets/films/logo_episode09.png",
      "poster": "https://lumiere-a.akamaihd.net/v1/images/p_starwarstheriseofskywalker_18508_3840c966.jpeg",
      "scenes": [
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/the-rise-of-skywalker-story-gallery-01_de912636.jpeg",
          "description": "Among the charred irontrees of Mustafar, Kylo Ren strikes down anyone in his path as he makes his way to the ruins of Darth Vader's castle. He finds an ancient Sith artifact his grandfather once possessed: the Sith Wayfinder."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/the-rise-of-skywalker-story-gallery-02_27fba2f1.jpeg",
          "description": "Ren uses the device to calculate the route to the hidden planet Exegol in the Unknown Regions. The troubled warrior quickly discovers that the dark and dangerous world is home to the resurrected Palpatine, the Sith, and a massive fleet of Star Destroyers. Palpatine tells Kylo Ren that Rey is not who he thinks she is..."
        },
        {
          "image": "https://lumiere-a.akamaihd.net/v1/images/the-rise-of-skywalker-story-gallery-03_ec90d25f.jpeg",
          "description": "Finn, Poe, Chewbacca, Klaud, and R2-D2 travel to the icy Sinta Glacier Colony to retrieve valuable intel from a spy in the First Order. Their jovial contact Boolio transfers the data just in time, as First Order TIE fighters scream through the atmosphere."
        }
      ]
    }
]